import { News } from "./Welcome";

export const tempNews: News[] = [
  {
    id: 0,
    title: "Да, небо темнеет",
    description:
      "Принимая во внимание показатели успешности, реализация намеченных плановых заданий играет определяющее значение для соответствующих условий активизации. Идейные соображения высшего порядка, а также высококачественный прототип будущего проекта создаёт предпосылки для стандартных подходов.",
    text: `In a web browser, you can link to different pages using an anchor (<a>) tag. When the user clicks on a link, the URL is pushed to the browser history stack. When the user presses the back button, the browser pops the item from the top of the history stack, so the active page is now the previously visited page. React Native doesn't have a built-in idea of a global history stack like a web browser does -- this is where React Navigation enters the story.

React Navigation\'s native stack navigator provides a way for your app to transition between screens and manage navigation history. If your app uses only one stack navigator then it is conceptually similar to how a web browser handles navigation state - your app pushes and pops items from the navigation stack as users interact with it, and this results in the user seeing different screens. A key difference between how this works in a web browser and in React Navigation is that React Navigation's native stack navigator provides the gestures and animations that you would expect on Android and iOS when navigating between routes in the stack.`,
    img: "https://img.freepik.com/premium-photo/colorful-image-glass-ball-with-word-color-ball_912214-189.jpg",
  },
  {
    id: 1,
    title: "Оказывается, ночь оказалась долгой",
    description:
      "Противоположная точка зрения подразумевает, что интерактивные прототипы будут объявлены нарушающими общечеловеческие нормы этики и морали. Сложно сказать, почему диаграммы связей будут рассмотрены исключительно в разрезе маркетинговых и финансовых предпосылок.",
    text: `Разнообразный и богатый опыт говорит нам, что высокотехнологичная концепция общественного уклада выявляет срочную потребность анализа существующих паттернов поведения. Но реплицированные с зарубежных источников, современные исследования объективно рассмотрены соответствующими инстанциями. В рамках спецификации современных стандартов, диаграммы связей описаны максимально подробно. Для современного мира укрепление и развитие внутренней структуры влечет за собой процесс внедрения и модернизации укрепления моральных ценностей. Противоположная точка зрения подразумевает, что элементы политического процесса лишь добавляют фракционных разногласий и заблокированы в рамках своих собственных рациональных ограничений. Учитывая ключевые сценарии поведения, разбавленное изрядной долей эмпатии, рациональное мышление влечет за собой процесс внедрения и модернизации форм воздействия.

    В своём стремлении улучшить пользовательский опыт мы упускаем, что ключевые особенности структуры проекта лишь добавляют фракционных разногласий и представлены в исключительно положительном свете. Каждый из нас понимает очевидную вещь: сплочённость команды профессионалов позволяет выполнить важные задания по разработке новых предложений. Являясь всего лишь частью общей картины, активно развивающиеся страны третьего мира являются только методом политического участия и разоблачены. Также как глубокий уровень погружения требует от нас анализа существующих финансовых и административных условий! Кстати, представители современных социальных резервов в равной степени предоставлены сами себе.`,
    img: "https://media.istockphoto.com/id/1140180560/ru/%D1%84%D0%BE%D1%82%D0%BE/%D1%86%D0%B2%D0%B5%D1%82%D0%BD%D0%BE%D0%B9-%D0%BF%D0%BE%D1%80%D0%BE%D1%85%D0%BE%D0%B2%D0%BE%D0%B9-%D0%B2%D0%B7%D1%80%D1%8B%D0%B2-%D0%BD%D0%B0-%D1%87%D0%B5%D1%80%D0%BD%D0%BE%D0%BC-%D1%84%D0%BE%D0%BD%D0%B5.jpg?s=612x612&w=0&k=20&c=_tD3ohuaqsWxSS8KNrE1-_xvMmwyJmTMrNawIfyRYa0=",
  },
  {
    id: 2,
    title: "Нет звука приятнее, чем полуночный пёсий вой",
    description:
      "Но явные признаки победы институционализации неоднозначны и будут в равной степени предоставлены сами себе. С другой стороны, реализация намеченных плановых заданий позволяет оценить значение своевременного выполнения сверхзадачи.",
    text: `С другой стороны, синтетическое тестирование прекрасно подходит для реализации системы массового участия. Внезапно, ключевые особенности структуры проекта, инициированные исключительно синтетически, представлены в исключительно положительном свете. В рамках спецификации современных стандартов, акционеры крупнейших компаний набирают популярность среди определенных слоев населения, а значит, должны быть функционально разнесены на независимые элементы. Наше дело не так однозначно, как может показаться: убеждённость некоторых оппонентов, в своём классическом представлении, допускает внедрение форм воздействия.

      Предварительные выводы неутешительны: дальнейшее развитие различных форм деятельности представляет собой интересный эксперимент проверки первоочередных требований. Предварительные выводы неутешительны: существующая теория в значительной степени обусловливает важность новых принципов формирования материально-технической и кадровой базы. Безусловно, разбавленное изрядной долей эмпатии, рациональное мышление напрямую зависит от направлений прогрессивного развития.`,
    img: "https://web-tool.org/create-round-image/rectangular-image.jpg",
  },
];
